
n4 = 3
n5 = 3
n6 = 3

n8 = 3
n8 = 3

print(n8)

"""
Ничего не понятно... Не вижу замены типов по заданию и даже получение идентификатора объекта через id
"""

var1 = input("Введите что-нибудь:")
var2 = "привет"[0:6:2]
var3 = "привет"[1:6:2]
print(var2, var3,sep ='     ',end ='!!!')

"""
Слово должно вводиться с клавиатуры, а не задаваться явно в коде
Длину слова указывать не нужно! так как слово может быть разной длины
Для вывода решения нужно использовать функцию print() дважды, почитайте внимательно задание
"""


